In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('staff sample.csv')

In [6]:
df.sample(20) #getting an idea of data

,Emp ID,Name,Gender,Department,Salary,Start Date,FTE,Employee type,Work location
222,SQ04934,Pedro St. Hill,Male,Engineering,NaN,1/11/2021,0.7,Permanent,"Seattle, USA"
172,PR03886,Edd MacKnockiter,Male,Accounting,"$119,022.49",8/23/2021,1.0,Permanent,"Auckland, New Zealand"
195,PR02957,Vaughn Carvill,Female,Training,"$84,745.93",30-Aug-19,1.0,Permanent,"Wellington, New Zealand"
151,SQ02638,Cara Havers,Male,Marketing,"$89,605.13",7-Jun-18,1.0,Permanent,"Seattle, USA"
270,TN02988,Mahindra Sreedharan,Male,Engineering,"$92,943.89",11/10/2021,1.0,Permanent,"Hyderabad, India"
233,PR00246,Husein Augar,Female,Marketing,"$67,905.80",12/29/2020,1.0,Permanent,Remote
92,TN03575,Janina Wolverson,Female,Research and Development,"$99,683.67",4-Feb-19,1.0,Fixed Term,"Seattle, USA"
54,PR03844,Brose MacCorkell,Female,Human Resources,"$35,943.62",9/4/2020,1.0,Permanent,"Columbus, USA"
205,TN01701,Yves Pawlik,Male,Accounting,"$57,925.91",17-Apr-19,0.5,Permanent,"Wellington, New Zealand"
102,SQ02223,Pippy Shepperd,Female,Accounting,"$44,845.33",26-Jun-18,1.0,Permanent,"Seattle, USA"
167,TN02674,Antonetta Coggeshall,Male,Sales,"$96,753.78",10/25/2021,1.0,Permanent,"Auckland, New Zealand"
260,VT03771,Marjie Bamford,Male,Sales,"$80,772.92","Nov 2, 2020",1.0,Temporary,Remote
94,PR00095,Devrat Damarsingh,Female,Business Development,"$70,649.46",13-Jan-20,1.0,Permanent,"Hyderabad, India"
181,VT04373,Edi Hofton,Male,Research and Development,"$28,160.79",29-Jan-18,1.0,Temporary,Remote
153,VT04552,Theresita Chasmer,Female,Product Management,"$106,665.67",7/30/2018,1.0,Temporary,"Columbus, USA"
71,PR01346,Adolph McNalley,Male,Business Development,"$85,918.61",5-Feb-18,1.0,Permanent,"Columbus, USA"
212,TN04428,Tadio Audritt,NaN,Human Resources,"$99,448.78",8-Jan-19,1.0,Fixed Term,"Wellington, New Zealand"
226,PR04851,Rodina Drinan,Female,Sales,"$77,045.44",20-Jun-19,1.0,Permanent,Remote
197,VT00596,Letisha Carrett,Female,Sales,"$84,598.88",12-Oct-20,1.0,Fixed Term,"Seattle, USA"
139,SQ01026,Anumati Shyamari Meherhomji,Male,Product Management,"$74,924.65",12-Feb-21,1.0,Permanent,"Hyderabad, India"

In [7]:

df['Emp ID'].is_unique # making sure employee id appears once

False

In [8]:
df = df.drop_duplicates(subset=['Emp ID']) #dropping duplicate employee id's and rows

In [9]:
df['Emp ID'].is_unique # checking whether the transformation has worked

True

In [41]:
df = df.dropna(subset=['Name'])  #removing nulls

In [12]:
df['Department'] = df['Department'].replace('???', 'TBA') # replacing inconsistent values in department columm

In [14]:
df['Department'].str.strip() != df['Department'] # checking whether any inconsistent spacing exists in department column

0      False
1      False
2      False
3      False
4      False
       ...
270    False
271    False
272    False
274    False
275    False
Name: Department, Length: 241, dtype: bool

In [15]:
df # current shape of the data after transformation

,Emp ID,Name,Gender,Department,Salary,Start Date,FTE,Employee type,Work location
0,PR00147,Minerva Ricardot,Male,TBA,"$120,000.00",12-Nov-18,1.0,Permanent,Remote
1,PR04686,Oona Donan,Female,Business Development,"$98,000.00",9/2/2019,0.9,Permanent,"Seattle, USA"
2,SQ04612,Mick Spraberry,Female,Services,"$120,000.00",3/12/2020,0.9,Permanent,Remote
3,VT01803,Freddy Linford,Female,Training,"$93,128.34","Mar 5, 2018",1.0,Fixed Term,"Seattle, USA"
4,TN02749,Parasuramudu Jamakayala,Female,Training,"$57,002.02",2-Apr-18,0.7,Permanent,"Hyderabad, India"
...,...,...,...,...,...,...,...,...,...
270,TN02988,Mahindra Sreedharan,Male,Engineering,"$92,943.89",11/10/2021,1.0,Permanent,"Hyderabad, India"
271,VT04905,Suchira Bhanupriya Tapti,Female,Human Resources,"$29,808.07",10-Jul-18,0.3,Temporary,"Hyderabad, India"
272,PR04366,Carry Loblie,Female,Sales,"$47,551.89",1/3/2019,1.0,Permanent,"Auckland, New Zealand"
274,TN04775,Hridaynath Tendulkar,Female,Legal,"$31,089.22",11/7/2019,1.0,Fixed Term,"Chennai, India"
275,SQ03625,Fidela Artis,Female,Sales,"$78,020.39",3/9/2020,1.0,Permanent,Remote

In [42]:
df['Start Date'] = pd.to_datetime(df['Start Date'], errors='coerce') #fixing date inconsistency

In [22]:
df[["City", "Country"]] = (
    df["Work location"]
    .apply(
        lambda x: ["Remote", "Online"]
        if x.strip().lower() == "remote"                      # slicing the "Work location" column into two columns: city, country
        else [i.strip() for i in x.split(",")]
    )
    .apply(pd.Series)
)

df

,Emp ID,Name,Gender,Department,Salary,Start Date,FTE,Employee type,Work location,city,country,City,Country
0,PR00147,Minerva Ricardot,Male,TBA,"$120,000.00",2018-11-12,1.0,Permanent,Remote,Remote,Online,Remote,Online
1,PR04686,Oona Donan,Female,Business Development,"$98,000.00",2019-09-02,0.9,Permanent,"Seattle, USA",Seattle,USA,Seattle,USA
2,SQ04612,Mick Spraberry,Female,Services,"$120,000.00",2020-03-12,0.9,Permanent,Remote,Remote,Online,Remote,Online
3,VT01803,Freddy Linford,Female,Training,"$93,128.34",2018-03-05,1.0,Fixed Term,"Seattle, USA",Seattle,USA,Seattle,USA
4,TN02749,Parasuramudu Jamakayala,Female,Training,"$57,002.02",2018-04-02,0.7,Permanent,"Hyderabad, India",Hyderabad,India,Hyderabad,India
...,...,...,...,...,...,...,...,...,...,...,...,...,...
270,TN02988,Mahindra Sreedharan,Male,Engineering,"$92,943.89",2021-11-10,1.0,Permanent,"Hyderabad, India",Hyderabad,India,Hyderabad,India
271,VT04905,Suchira Bhanupriya Tapti,Female,Human Resources,"$29,808.07",2018-07-10,0.3,Temporary,"Hyderabad, India",Hyderabad,India,Hyderabad,India
272,PR04366,Carry Loblie,Female,Sales,"$47,551.89",2019-01-03,1.0,Permanent,"Auckland, New Zealand",Auckland,New Zealand,Auckland,New Zealand
274,TN04775,Hridaynath Tendulkar,Female,Legal,"$31,089.22",2019-11-07,1.0,Fixed Term,"Chennai, India",Chennai,India,Chennai,India
275,SQ03625,Fidela Artis,Female,Sales,"$78,020.39",2020-03-09,1.0,Permanent,Remote,Remote,Online,Remote,Online

In [38]:
df['Salary'] = df['Salary'].replace('[\$,]', '', regex=True).astype(float) #converting the data into float
df['Salary'] = df['Salary'].round() #rounding off the salary
df["Salary"] = df["Salary"].map(lambda x: f"${x:,.0f}") #standardizing the column presentation

<>:1: SyntaxWarning: invalid escape sequence '\$'
<>:1: SyntaxWarning: invalid escape sequence '\$'
C:\Users\ariya\AppData\Local\Temp\ipykernel_11360\2740013933.py:1: SyntaxWarning: invalid escape sequence '\$'
  df['Salary'] = df['Salary'].replace('[\$,]', '', regex=True).astype(float) #converting the data into float

In [39]:
df #Data Cleaned

,Emp ID,Name,Gender,Department,Salary,Start Date,FTE,Employee type,City,Country
0,PR00147,Minerva Ricardot,Male,TBA,"$120,000",2018-11-12,1.0,Permanent,Remote,Online
1,PR04686,Oona Donan,Female,Business Development,"$98,000",2019-09-02,0.9,Permanent,Seattle,USA
2,SQ04612,Mick Spraberry,Female,Services,"$120,000",2020-03-12,0.9,Permanent,Remote,Online
3,VT01803,Freddy Linford,Female,Training,"$93,128",2018-03-05,1.0,Fixed Term,Seattle,USA
4,TN02749,Parasuramudu Jamakayala,Female,Training,"$57,002",2018-04-02,0.7,Permanent,Hyderabad,India
...,...,...,...,...,...,...,...,...,...,...
270,TN02988,Mahindra Sreedharan,Male,Engineering,"$92,944",2021-11-10,1.0,Permanent,Hyderabad,India
271,VT04905,Suchira Bhanupriya Tapti,Female,Human Resources,"$29,808",2018-07-10,0.3,Temporary,Hyderabad,India
272,PR04366,Carry Loblie,Female,Sales,"$47,552",2019-01-03,1.0,Permanent,Auckland,New Zealand
274,TN04775,Hridaynath Tendulkar,Female,Legal,"$31,089",2019-11-07,1.0,Fixed Term,Chennai,India
275,SQ03625,Fidela Artis,Female,Sales,"$78,020",2020-03-09,1.0,Permanent,Remote,Online